In [1]:
import pandas as pd

In [2]:
customer_data = pd.read_csv(f"./chapter1_data/customer_master.csv")
item_master = pd.read_csv(f"./chapter1_data/item_master.csv")
transaction_1 = pd.read_csv(f"./chapter1_data/transaction_1.csv")
transaction_2 = pd.read_csv(f"./chapter1_data/transaction_2.csv")
transaction_detail_1 = pd.read_csv(f"./chapter1_data/transaction_detail_1.csv")
transaction_detail_2 = pd.read_csv(f"./chapter1_data/transaction_detail_2.csv")
# transaction_1,2をタテに結合
transaction = pd.concat([transaction_1, transaction_2], ignore_index=True)
del transaction_1, transaction_2
# transaction_detail1,2もタテに結合
transaction_detail = pd.concat([transaction_detail_1, transaction_detail_2], ignore_index=True)
del transaction_detail_1, transaction_detail_2

In [3]:
display(customer_data.head(3))
display(item_master.head(3))
display(transaction.head(3))
display(transaction_detail.head(3))

,customer_id,customer_name,registration_date,customer_name_kana,email,gender,age,birth,pref
0,IK152942,平田 裕次郎,2019-01-01 00:25:33,ひらた ゆうじろう,hirata_yuujirou@example.com,M,29,1990/6/10,石川県
1,TS808488,田村 詩織,2019-01-01 01:13:45,たむら しおり,tamura_shiori@example.com,F,33,1986/5/20,東京都
2,AS834628,久野 由樹,2019-01-01 02:00:14,ひさの ゆき,hisano_yuki@example.com,F,63,1956/1/2,茨城県

  item_id item_name  item_price
0    S001      PC-A       50000
1    S002      PC-B       85000
2    S003      PC-C      120000

  transaction_id   price         payment_date customer_id
0    T0000000113  210000  2019-02-01 01:36:57    PL563502
1    T0000000114   50000  2019-02-01 01:37:23    HD678019
2    T0000000115  120000  2019-02-01 02:34:19    HD298120

   detail_id transaction_id item_id  quantity
0          0    T0000000113    S005         1
1          1    T0000000114    S001         1
2          2    T0000000115    S003         1

In [4]:
# データのヨコ結合
# transaction_detail に　transaction　の　payment_date、customer_id　を連結したい

In [5]:
transaction_detail.shape, transaction.shape

((7144, 4), (6786, 4))

In [6]:
transaction_detail["transaction_id"].nunique(), transaction["transaction_id"].nunique()

(6786, 6786)

In [7]:
set(transaction_detail["transaction_id"]) - set(transaction["transaction_id"])

set()

In [8]:
join_data = transaction_detail.merge(
    transaction[["transaction_id", "payment_date","customer_id"]] , 
    how="left", 
    on = "transaction_id")
join_data.head()

   detail_id transaction_id item_id  quantity         payment_date customer_id
0          0    T0000000113    S005         1  2019-02-01 01:36:57    PL563502
1          1    T0000000114    S001         1  2019-02-01 01:37:23    HD678019
2          2    T0000000115    S003         1  2019-02-01 02:34:19    HD298120
3          3    T0000000116    S005         1  2019-02-01 02:47:23    IK452215
4          4    T0000000117    S002         2  2019-02-01 04:33:46    PL542865

In [9]:
join_data.shape

(7144, 6)

In [10]:
# データのヨコ結合
# customerマスタもつなげる

In [11]:
join_data["customer_id"].nunique(), customer_data["customer_id"].nunique()

(3018, 5000)

In [12]:
set(join_data["customer_id"]) - set(customer_data["customer_id"])

set()

In [13]:
join_data.shape, customer_data.shape

((7144, 6), (5000, 9))

In [14]:
join_data = join_data.merge(customer_data, how = "left", on = "customer_id")
join_data.head()

,detail_id,transaction_id,item_id,quantity,payment_date,customer_id,customer_name,registration_date,customer_name_kana,email,gender,age,birth,pref
0,0,T0000000113,S005,1,2019-02-01 01:36:57,PL563502,井本 芳正,2019-01-07 14:34:35,いもと よしまさ,imoto_yoshimasa@example.com,M,30,1989/7/15,熊本県
1,1,T0000000114,S001,1,2019-02-01 01:37:23,HD678019,三船 六郎,2019-01-27 18:00:11,みふね ろくろう,mifune_rokurou@example.com,M,73,1945/11/29,京都府
2,2,T0000000115,S003,1,2019-02-01 02:34:19,HD298120,山根 小雁,2019-01-11 08:16:02,やまね こがん,yamane_kogan@example.com,M,42,1977/5/17,茨城県
3,3,T0000000116,S005,1,2019-02-01 02:47:23,IK452215,池田 菜摘,2019-01-10 05:07:38,いけだ なつみ,ikeda_natsumi@example.com,F,47,1972/3/17,兵庫県
4,4,T0000000117,S002,2,2019-02-01 04:33:46,PL542865,栗田 憲一,2019-01-25 06:46:05,くりた けんいち,kurita_kenichi@example.com,M,74,1944/12/17,長崎県

In [15]:
join_data.shape

(7144, 14)

In [16]:
# データのヨコ結合
# item_masterもつなげる

In [17]:
join_data["item_id"].nunique(), item_master["item_id"].nunique()

(5, 5)

In [18]:
set(join_data["item_id"]) - set(item_master["item_id"])

set()

In [19]:
join_data.shape, item_master.shape

((7144, 14), (5, 3))

In [22]:
join_data = join_data.merge(item_master, how ="left", on="item_id")
join_data.head()

,detail_id,transaction_id,item_id,quantity,payment_date,customer_id,customer_name,registration_date,customer_name_kana,email,gender,age,birth,pref,item_name,item_price
0,0,T0000000113,S005,1,2019-02-01 01:36:57,PL563502,井本 芳正,2019-01-07 14:34:35,いもと よしまさ,imoto_yoshimasa@example.com,M,30,1989/7/15,熊本県,PC-E,210000
1,1,T0000000114,S001,1,2019-02-01 01:37:23,HD678019,三船 六郎,2019-01-27 18:00:11,みふね ろくろう,mifune_rokurou@example.com,M,73,1945/11/29,京都府,PC-A,50000
2,2,T0000000115,S003,1,2019-02-01 02:34:19,HD298120,山根 小雁,2019-01-11 08:16:02,やまね こがん,yamane_kogan@example.com,M,42,1977/5/17,茨城県,PC-C,120000
3,3,T0000000116,S005,1,2019-02-01 02:47:23,IK452215,池田 菜摘,2019-01-10 05:07:38,いけだ なつみ,ikeda_natsumi@example.com,F,47,1972/3/17,兵庫県,PC-E,210000
4,4,T0000000117,S002,2,2019-02-01 04:33:46,PL542865,栗田 憲一,2019-01-25 06:46:05,くりた けんいち,kurita_kenichi@example.com,M,74,1944/12/17,長崎県,PC-B,85000

In [23]:
join_data.shape

(7144, 16)